{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/12/14/hello-world/"},{"title":"Leetcode 1 Two Sum","text":"question:Given an array of integers nums and an integer target, return indices of the two numbers such that they add up to target. You may assume that each input would have *exactly* one solution, and you may not use the same element twice. You can return the answer in any order. basic ideaThe simplest but not so efficient method is to iterate the array and for every item in the array, we iterate the items after it and to check if we could get the the sum we want. Time complexity of this method would be O(n^2). So how do we make the solution more efficient? Let’s look at an example. If the input is [2, 11, 15, 6], and the target is 8. We iterate the input array and when the current item is 2, we expect to find 6. we can use a map to save the index of the item 2 and the number we expect to find, which is 6. When the current items becomes 6, we check the map and find it’s just what we wanted. my solution123456789101112131415161718class Solution { public int[] twoSum(int[] nums, int target) { int[] res = new int[2]; Map&lt;Integer, Integer&gt; map = new HashMap(); for(int i = 0; i &lt; nums.length; i++){ int curr = nums[i]; if(i &gt; 0 &amp;&amp; map.containsKey(curr)){ res[0] = map.get(curr); res[1] = i; return res; } map.put(target - nums[i], i); } return res; }} time complexity: O(n) - in the worst scenario, we need to interate the whole array once space complexity: O(n) - we need an extra map","link":"/2022/12/14/Leetcode-1-Two-Sum/"},{"title":"course notes - bilibli clone","text":"Below are the notes that I took when I was learning the course “SpringBoot2.x实战B站高性能后端项目”(making a high-performance back-end project by imitating Bilibili) CHAPTER 1 project environment setup1.create a new projectThis is a multi-module project, so I need to create several modules. The basic modules in this project are: bili-api (controller) bili-service bili-dao ​ After creating the modules above, I need to create configuration files. ​ bili-api —- 2 configuration files, application-test.properties and application-online.properties. Then in the service module, create a file that contains the common configurations - application.properties 2. spring boot dependencies and dependencies between moduels (1) add SpringBoot parent denpendency and spring-web (2) dependencies between moduels : service is dependent on dao and api is dependent on service errors here: pom file in bili-api is grayed out and strikethrough ​ solution: Preferences-Maven-IgnoredFiles, uncheck the pom file. 3. launch the project (1) create a BiliApp.java file in bili-api, and add the code below 123456789@SpringBootApplicationpublic class BiliApp{ public static void main( String[] args ) { ApplicationContext app = SpringApplication.run(BiliApp.class, args); }} (2)set the profile 12# profilespring.profiles.active = test errors and problems here: “SpringBootApplication.run“ becomes red simply because I wrote SpringBootApplication instead of SpringApplication the icon before configuration file isn’t right. ref: https://blog.51cto.com/u_15441799/4675193 Exception in thread &quot;main&quot; java.lang.NoClassDefFoundError solution: I took a lot of time to search on Google, but it was still not solved. Then I noticed that the version of spring-context and the version of spring-boot were shown in the error message, so I tried to upgrade the version of spring-boot, and it worked! profile set in a applicaiton.properties is not detected, error message: No active profile set, falling back to default profiles:default solution: I set the profile in ‘Edit configuration’ window and it worked. I tested and found that the configuration file in api module can be read properly. But I’m still wondering why setting profile in the configuration file doesn’t work. tomcat jar file broken, error message: tomcat-embed-core-9.0.53.jar; zip file is empty solution: delete tomcat-embed-core from external libraries and re-add it. 4. datasource configuration and persistence layer setup(1)MySQL dependency and configurations for datasource (2) Mybatis dependency and configurations for it (3) create tesDao/controller/service error1 : Invalid bound statement (not found): org.example.dao.TestDao.findUserNameById Actually this error is linked with the profile error above. application.properties in the parent module is not read. some attemption: 1234@PropertySources({ @PropertySource(&quot;classpath:application.properties&quot;)})// I tried to add this before the startup class and I got an exception :java.io.FileNotFoundException: class path resource [application.properties] cannot be opened because it does not exist So it means that the application.properties file is totally not found by my application. After reading https://blog.csdn.net/weixin_44695793/article/details/107752054, I noticed that there is no target folder in the parent directory, which means that application.properties file is not compiled. Then I opened the demonstration file from the course and tried to compare it with mine. Then I noticed that I put the application.properties file in the wrong place. It should in servcie-module. After correcting this, it seems that the problem above is solved. But there is a new problem. error2 : FileNotFoundException: class path resource [mapper/*.xml] cannot be opened because it does not exist solution: 1234mybatis.config-location=classpath:mapper/*.xml# I wronly wrote the configuration. The right one should be: mybatis.mapper-locations=classpath:mapper/*.xml # notice: * mapper / * locations 5. hot deployment(1)preferences- compiler - check build project automatically (2) command + option +shift + / open Maintenance window, click ‘registry’, check the following two options: compiler.document.save.enabled compiler.automake.allow.when.app.runningi(for newer edition of IDEA, go to Preferences-Advanced Settings- check ‘Allow auto-mae to start even if deveploped application is currently running’) (3)click edit-configuration ​ change ‘on Update action’ and ‘on frame deactivation’ to ‘update classes and resources’. (4) add spring-devtools dependency and configuration 1spring.devtools.restart.enabled=true In fact, it didn’t work after I had followed the instructions aboved, which are given by the instructor of the course. I did what was said in https://blog.csdn.net/luokha/article/details/119746359 (check compiler-compile indepenetd modules in parallel). Then it worked.","link":"/2022/12/14/course-notes%20bilibilib%20clone-1/"}],"tags":[{"name":"Leetcode","slug":"Leetcode","link":"/tags/Leetcode/"},{"name":"notes","slug":"notes","link":"/tags/notes/"},{"name":"course-notes","slug":"course-notes","link":"/tags/course-notes/"},{"name":"Java","slug":"Java","link":"/tags/Java/"}],"categories":[{"name":"Leetcode","slug":"Leetcode","link":"/categories/Leetcode/"}],"pages":[]}